'''#todo: Явно привести к списку строку
>>>list('hello')
...['h', 'e', 'l', 'l', 'o']

>>> list('1234')
...['1', '2', '3', '4']
#todo: Пронумеровать элементы строки
>>> list(enumerate(list('123457'))
...[(0, '1'), (1, '2'), (2, '3'), (3, '4'), (4, '5'), (5, '7')]

#todo: разбить строку на список по пробелу
>>> 'hi hi hi'.split()
...['hi', 'hi', 'hi']

>>> input().split()
>>> 12 13 14
... ['12', '13', '14']

# todo: список строк привести к int
>>> list(map(int, ['12', '13', '14']))
...[12, 13, 14]

#todo: создать итератор по двум спискам
>>> lst = ['12', '13', '14']
>>> lst1 = ['a', 'b', 'c']
>>> list(zip(lst1, lst))
... [('a', '12'), ('b', '13'), ('c', '14')]

#todo: умножить строку на число
>>> '5' * 3
... '555'

>>> input() * 3
... 1
... '111'''
