"""1. Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе."""


a = [1, 2, 3, 4, True, False, "a", "d", 2.2]
for b in a:
    print(type(b))