# При решении ориентироваться на lesson18.py

""" Напишите функцию ОЖИДАЮЩУЮ от пользователя строку, а потом возврающую её с "-"
вместо пробелов. Например "I am a grate Teacher!" станет "I-am-a-grate-Teacher!"  """

""" Напишите функцию ОЖИДАЮЩУЮ от пользователя строку, а потом возврающую её в верхнем 
регистре. Например "You are a grate coder!"  станет "YOU ARE A GRATE CODER!".
P.S. .upper() и .capitalize() похожи, но чем они отличаюся? """

# text = input()
# text1 = text.split()
# text2 = "-".join(text1)
# print(text2)
# I am glad to see you

text = input()
text1 = text.upper()
print(text1)