# 1) Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида
sweets = {
    'название сладости': [
        {'shop': 'название магазина', 'price': 99.99},
        {'shop': 'название магазина', 'price': 99.99},
    ],
}


# print(shops['ашан'][0]['price'])


def get_sweets(dct):
    sweets = {}

    for grocery in shops:
        for dct in shops[grocery]:
            if dct['name'] in sweets:
                sweets[dct['name']].append({'shop': grocery, 'price': dct['price']})
            else:
                sweets[dct['name']] = [{'shop': grocery, 'price': dct['price']}]
    return sweets


for key, value in get_sweets(shops).items():
    print(key)
    for dct in value:
        print(dct)
    print()

# 2) Есть словарь кодов товаров

goods = {
    'Лампа': '12345',
    'Стол': '23456',
    'Диван': '34567',
    'Стул': '45678',
}

# Есть словарь списков количества товаров на складе.

store = {
    '12345': [
        {'quantity': 27, 'price': 42},
    ],
    '23456': [
        {'quantity': 22, 'price': 510},
        {'quantity': 32, 'price': 520},
    ],
    '34567': [
        {'quantity': 2, 'price': 1200},
        {'quantity': 1, 'price': 1150},
    ],
    '45678': [
        {'quantity': 50, 'price': 100},
        {'quantity': 12, 'price': 95},
        {'quantity': 43, 'price': 97},
    ],
}

